{
	"meta": {
		"title": "Macropad",
		"date": "November 30, 2021",
		"type": "Python C++ Solidworks",
		"description": "AI powered cat feeding robot, powered by Arduino.",
		"featured": true
	},
	"blocks": [
		{
			"slider": [
				"overlay1.png",
				"overlay2.png"
			]
		},
		{
			"title": "Overview",
			"text": "When looking for a macropad on Amazon, I found that everything was overpriced, with little functionality. Then I remembered, I have a 3D printer! With some CAD, Python, and C++ the custom macropad was created."
		},
		{
			"title": "Technical",
			"text": "This gadget employs the functionality of an Arduino Nano, connected to 11 Cherry MX Blue switches. Using the input-pullup feature on the Nano, we can implement detection for keypresses by just connecting the switch to a pin and ground. From here, the arduino will send a serial code to the computer, which will be read by a python script (that is consistently running on startup). This python script is able to execute Spotify API calls, simulate keystrokes, or do anything else with the capabilities of python, nearly limitless."
		},
		{
			"title": "Electrical",
			"text": "I used EasyEDA to design a schematic and an PCB, which I ordered using JLCPCB. It was an awesome experience learning how to make a PCB, and I think that I will use this skill for future projects. Check it out below, or open it on <a href='https://easyeda.com/editor#id=53ef828834a34f2d87e6da74e034d6bf'>EasyEDA</a>.",
			"image": ["main.png", "pcb.jpg"]
		},
		{
			"title": "Materials",
			"ul": [
				"PLA Plastic Filament (housing, keycaps)",
				"<a href='https://www.aliexpress.com/item/1005002588583066.html'>Cherry MX Blues</a> (x11)",
				"<a href='https://store.arduino.cc/products/arduino-nano'>Arduino Nano</a>",
				"<a href='https://jlcpcb.com/'>JCL PCB</a> Board",
				"USB Mini-B Cable",
				"1/4\" 10-24 Machine Screws (x4)"
			]
		},
		{
			"title": "Functionality",
			"text": "In the end, am I using it? No. I thought it would be wonderful to have additional programmable keys on my keyboard but it turns out it was more of a hassle than it was worth. I do believe that this is very practical, as being able to activate a python script with a keypress has limitless potential. I also had a bit of trouble configuring the input pullups, which would trigger multiple keys on one keypress. After consulting an electrical engineer about the problem still no solution was found, I am concluding that it results from buying cheap Arduino's off of Aliexpress. Nevertheless, a very fun project that has a lot of potential."
		}
	]
}