{
	"experience": [
		{
			"title": "Software Developer",
			"subtitle": "BusPlanner Inc.",
			"date": "2023 - Present",
			"description": "Working as a co-op student on the advanced BusPlanner student transportation suite. Working on front-end testing and development, as well as SQL database solutions. Looking forward to contributing to the team and learning as much as possible!"
		},
		{
			"title": "Powertrain Member",
			"subtitle": "University of Waterloo Formula Motorsports",
			"date": "2022 - Present",
			"description": "The Univesity of Waterloo Formula Motorsports team works to develop a competitive racecar each year. Although a new member of the team, I've worked to manufacture high-precision parts and used SolidWorks skills to develop 3D printed assembly aids."
		},
		{
			"title": "Clubhouse Employee",
			"subtitle": "Merry Hill Golf Club",
			"date": "2020 - 2022",
			"description": "I work to provide excellent customer experiences at Merry Hill Golf Club, and work to provide the best customer service. I have not only gained skills with POS transactions, but I also have had plenty of experience in both diffusing situations with customers and working closely with a team to achieve results."
		},
		{
			"title": "FIRST Robotics",
			"subtitle": "FIRST Canada",
			"date": "2018 - 2022",
			"description": "Led a subteam of robotics students using project management and teamwork skills to build a mechanism to complete a given task. Learned many applicable leadership skills transferrable to any workplace, through working tirelessly to achieve an end result. Technical skills include manufacturing, CAD, software/web development, sponsorship, outreach, and business skills. <br><br> On top of leading a mechanical design and manufacturing subteam, I also was the sponsorship team lead, where I used many of my personal skills and industry techniques to attract, recruit and retain support for the team.",
			"ul": [
				"<a href='https://2702rebels.com' target='_blank'>2702 Rebels Website</a>",
				"<a href='https://www.youtube.com/watch?v=Qg6R_3o6a9M' target='_blank'>2019 Robot</a>",
				"<a href='https://www.youtube.com/watch?v=tN_Rt3pt054' target='_blank'>2020 Robot</a>",
				"<a href='https://www.firstinspires.org' target='_blank'>FIRST Program</a>"
			]
		},
		{
			"title": "Electric Racecar Team",
			"subtitle": "Bluevale Collegiate Institute",
			"date": "2021 - 2022",
			"description": "I am a part of the Bluevale Collegiate Electric Car Team, where I work with a small team to develop and build electric racecar. I took the lead on a few different aspects of the car, including designing an emergency stopping system, working on a driveshaft system, and fabricating an effective braking system. <br><br> In the two races at the University of Waterloo, our cars achieved the maximum positions possible, both first and second in the 12-volt race, and first place in the 24-volt race."
		},
		{
			"title": "Choose to Lead",
			"subtitle": "Bluevale Collegiate Institute",
			"date": "2018 - 2022",
			"description": "I was accepted into the 4 year intensive Choose to Lead program by demonstrating teamwork, cooperation, management, and leadership skills. It is structured around leadership in the community and building interpersonal skills. <br><br> Through this program, I have had further opportunities to strengthen my skills in these areas and network/meet more people who are like minded and leadership-oriented, as well have learned and practiced leadership styles and management techniques. More information about the program can be found <a href='https://bci.wrdsb.ca/choose-to-lead/' target='_blank'>here</a>."
		},
		{
			"title": "SHAD Fellow",
			"subtitle": "SHAD Canada",
			"date": "July 2020",
			"description": "I was accepted to and participated in SHAD Canada, a month-long STEM-based summer program being held (virtually) from the University of PEI. I learned and conversed with Ph.D. professors and business professionals about many different topics, ranging from cryptography to geological issues and starting businesses. In the end, with a small team I designed and engineered an award-winning solution to Canadian water problems.",
			"ul": [
				"<a href='https://shad.ca' target='_blank'>SHAD Canada Website</a>",
				"<a href='/projects/ecoflow/'>EcoFlow Water Project</a>",
				"<a href='https://owenmoogk.github.io/owenmoogk/shad.pdf' target='_blank'>SHAD Certificate</a>"
			]
		},
		{
			"title": "Umpire",
			"subtitle": "WMBA",
			"date": "2017 - 2020",
			"description": "As a paid umpire for the WMBA for 3 years I navigated difficult situations employing management and cooperation skills while promoting kindness, sportsmanship and fun."
		},
		{
			"title": "DECA",
			"subtitle": "DECA Business Competition",
			"date": "2018 - 2019",
			"description": "DECA is a global business competition, in which participants are given business case studies and must use both practical and personal skills to solve problems. <br><br> Category: Principles of Finance (PFN): Business situations associated with careers in Accounting, Banking Services, Business Finance, Insurance and Securities, and Investments. <br><br> Achieved:",
			"ul": [
				"Top 10% knowledge/written test",
				"Top 10% roleplay/practical test",
				"Advanced to provincial championship"
			]
		}
	],
	"education": [
		{
			"title": "Mechatronics Engineering Student",
			"subtitle": "University of Waterloo",
			"date": "2022 - 2027",
			"description": "As a mechatronics engineering student, I've been given the opportunity to study among an elite group of students. Among such, I have maintained an average above 95% while involving myself in the university community. The most notable involvement is with the UW Formula Motorsports team, where I am working to develop and manufacture the powertrain of a competitive racecar."
		},
		{
			"title": "High School - OSSD",
			"subtitle": "Bluevale Collegiate Institute",
			"date": "2018 - 2022",
			"description": ""
		}
	],
	"volunteer": [
		{
			"title": "Elderly Caregiver",
			"subtitle": "Parkwood Mennonite Home",
			"date": "2018 - 2020",
			"description": "Serving coffee and facilitating the morning church services, while befriending and caring for elderly residents."
		},
		{
			"title": "Team Mentor",
			"subtitle": "FIRST Canada",
			"date": "2018 - 2019",
			"description": "I mentored a local FLL robotics team, teaching and assisting with engineering and teamwork skills, with students from Grade 4 to Grade 8. It was quite enjoyable to create an environment for learning and teaching with hands-on skills, and give back to the program that I learned a lot from as a kid."
		}
	],
	"certifications": [
		{
			"title": "CS50 -- Intro to Computer science",
			"subtitle": "Harvard University",
			"date": "2020",
			"description": "Completed Harvard CS50 Course online, to gain a better understanding of computer basics and the low level operating systems."
		},
		{
			"title": "Responsive Web Design",
			"subtitle": "freeCodeCamp",
			"date": "July 2021",
			"description": "Completed the 300 hour course on responsive web design, to further solidify my skills and expose myself to different techniques and ideas.",
			"ul": [
				"<a href='https://www.freecodecamp.org/certification/owenmoogk/responsive-web-design' target='_blank'>Certification</a>"
			]
		},
		{
			"title": "SmartServe",
			"subtitle": "AGCO Ontario",
			"date": "July 2022",
			"description": "Completed the SmartServe alcohol training program. ",
			"ul": [
				"<a href='https://owenmoogk.github.io/owenmoogk/smartserve.pdf' target='_blank'>Certification</a>"
			]
		},
		{
			"title": "First Aid",
			"subtitle": "Red Cross",
			"date": "July 2022",
			"description": "Completed the Red Cross First Aid training program.",
			"ul": [
				"<a href='https://owenmoogk.github.io/owenmoogk/first-aid.pdf' target='_blank'>First Aid Certificate</a>"
			]
		}
	]
}